; RUN: opt -passes="hir-ssa-deconstruction,hir-loop-fusion,print<hir>" -aa-pipeline="basic-aa" -disable-output < %s 2>&1 | FileCheck %s

; Verify that loop fusion doesn't happen when extremely many locals are present.

; CHECK-NOT:    modified
; CHECK: DO i1 =

;     BEGIN REGION { }
;         + DO i1 = 0, zext.i32.i64(%4) + -4, 1   <DO_LOOP>  <MAX_TC_EST = 2147483644>
;         |   + DO i2 = 0, (sext.i32.i64(%6) + -1 * sext.i32.i64(%5) + -1)/u8, 1   <DO_LOOP>  <MAX_TC_EST = 536870912>
;           |   |   @llvm.lifetime.start.p0(2368,  &((i8*)(%8)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%9)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%10)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%11)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%12)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%13)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%14)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%15)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%16)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%17)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%18)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%19)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%20)[0]));
;           |   |   @llvm.lifetime.start.p0(64,  &((i8*)(%21)[0]));

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "NX", scope: !2, file: !8, line: 249, type: !35, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang based Intel(R) oneAPI DPC++/C++ Compiler 2021.4.0 (2021.x.0.YYYYMMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/localdisk2/yoonseoc/ics/xmain-clean/build_base_cpuv8.icx.0000")
!4 = !{}
!5 = !{!6, !12, !16, !18, !19, !20, !21, !22}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uvrt_t", file: !8, line: 187, baseType: !9)
!8 = !DIFile(filename: "./phys.h", directory: "/localdisk2/yoonseoc/ics/xmain-clean/build_base_cpuv8.icx.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 182, size: 256, elements: !10)
!10 = !{!11, !13, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !9, file: !8, line: 183, baseType: !12, size: 64)
!12 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !9, file: !8, line: 184, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !9, file: !8, line: 185, baseType: !12, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !9, file: !8, line: 186, baseType: !12, size: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "pop_t", file: !8, line: 180, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 178, size: 2368, elements: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !24, file: !8, line: 179, baseType: !27, size: 2368)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2368, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 37)
!30 = !{!31, !0, !33}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "IGSIZEY", scope: !2, file: !8, line: 247, type: !18, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "NY", scope: !2, file: !8, line: 249, type: !35, isLocal: false, isDefinition: true)
!35 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!36 = distinct !DICompileUnit(language: DW_LANG_C99, file: !37, producer: "clang based Intel(R) oneAPI DPC++/C++ Compiler 2021.4.0 (2021.x.0.YYYYMMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !4, splitDebugInlining: false, nameTableKind: None)
!37 = !DIFile(filename: "specrand/specrand.c", directory: "/localdisk2/yoonseoc/ics/xmain-clean/build_base_cpuv8.icx.0000")
!38 = !{!39, !35, !12}
!39 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !{!"Intel(R) oneAPI DPC++/C++ Compiler 2021.4.0 (2021.x.0.YYYYMMDD)"}
!41 = !{i32 7, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{i32 1, !"Virtual Function Elim", i32 0}
!45 = !{i32 7, !"uwtable", i32 1}
!46 = !{i32 1, !"ThinLTO", i32 0}
!47 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!48 = !{i32 1, !"LTOPostLink", i32 1}
!49 = distinct !DISubprogram(name: "myKernel", scope: !50, file: !50, line: 164, type: !51, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !84)
!50 = !DIFile(filename: "./kernels.h", directory: "/localdisk2/yoonseoc/ics/xmain-clean/build_base_cpuv8.icx.0000")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !53, !54, !79, !83, !83, !83, !83}
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "par_t", file: !8, line: 208, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 189, size: 42624, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ww", scope: !59, file: !8, line: 190, baseType: !27, size: 2368)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !59, file: !8, line: 191, baseType: !27, size: 2368, offset: 2368)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !59, file: !8, line: 192, baseType: !27, size: 2368, offset: 4736)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "H0", scope: !59, file: !8, line: 193, baseType: !27, size: 2368, offset: 7104)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "H1x", scope: !59, file: !8, line: 194, baseType: !27, size: 2368, offset: 9472)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "H1y", scope: !59, file: !8, line: 195, baseType: !27, size: 2368, offset: 11840)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "H2xx", scope: !59, file: !8, line: 196, baseType: !27, size: 2368, offset: 14208)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "H2xy", scope: !59, file: !8, line: 197, baseType: !27, size: 2368, offset: 16576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "H2yy", scope: !59, file: !8, line: 198, baseType: !27, size: 2368, offset: 18944)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "H3xxx", scope: !59, file: !8, line: 199, baseType: !27, size: 2368, offset: 21312)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "H3xxy", scope: !59, file: !8, line: 200, baseType: !27, size: 2368, offset: 23680)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "H3xyy", scope: !59, file: !8, line: 201, baseType: !27, size: 2368, offset: 26048)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "H3yyy", scope: !59, file: !8, line: 202, baseType: !27, size: 2368, offset: 28416)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "H4xxxx", scope: !59, file: !8, line: 203, baseType: !27, size: 2368, offset: 30784)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "H4xxxy", scope: !59, file: !8, line: 204, baseType: !27, size: 2368, offset: 33152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "H4xxyy", scope: !59, file: !8, line: 205, baseType: !27, size: 2368, offset: 35520)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "H4xyyy", scope: !59, file: !8, line: 206, baseType: !27, size: 2368, offset: 37888)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "H4yyyy", scope: !59, file: !8, line: 207, baseType: !27, size: 2368, offset: 40256)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !102, !103, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!85 = !DILocalVariable(name: "nxt", arg: 1, scope: !49, file: !50, line: 164, type: !53)
!86 = !DILocalVariable(name: "prv", arg: 2, scope: !49, file: !50, line: 165, type: !53)
!87 = !DILocalVariable(name: "param", arg: 3, scope: !49, file: !50, line: 166, type: !54)
!88 = !DILocalVariable(name: "offset", arg: 4, scope: !49, file: !50, line: 167, type: !79)
!89 = !DILocalVariable(name: "startX", arg: 5, scope: !49, file: !50, line: 168, type: !83)
!90 = !DILocalVariable(name: "endX", arg: 6, scope: !49, file: !50, line: 168, type: !83)
!91 = !DILocalVariable(name: "startY", arg: 7, scope: !49, file: !50, line: 168, type: !83)
!92 = !DILocalVariable(name: "endY", arg: 8, scope: !49, file: !50, line: 168, type: !83)
!93 = !DILocalVariable(name: "ix", scope: !49, file: !50, line: 170, type: !18)
!94 = !DILocalVariable(name: "iy", scope: !49, file: !50, line: 170, type: !18)
!95 = !DILocalVariable(name: "p", scope: !96, file: !50, line: 178, type: !18)
!96 = distinct !DILexicalBlock(scope: !97, file: !50, line: 176, column: 47)
!97 = distinct !DILexicalBlock(scope: !98, file: !50, line: 176, column: 5)
!98 = distinct !DILexicalBlock(scope: !99, file: !50, line: 176, column: 5)
!99 = distinct !DILexicalBlock(scope: !100, file: !50, line: 175, column: 40)
!100 = distinct !DILexicalBlock(scope: !101, file: !50, line: 175, column: 3)
!101 = distinct !DILexicalBlock(scope: !49, file: !50, line: 175, column: 3)
!102 = !DILocalVariable(name: "ic", scope: !96, file: !50, line: 179, type: !18)
!103 = !DILocalVariable(name: "popTemp", scope: !96, file: !50, line: 181, type: !104)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 18944, elements: !28)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdata_t", file: !8, line: 210, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 8)
!109 = !DILocalVariable(name: "rho", scope: !96, file: !50, line: 183, type: !105)
!110 = !DILocalVariable(name: "v", scope: !96, file: !50, line: 183, type: !105)
!111 = !DILocalVariable(name: "u", scope: !96, file: !50, line: 183, type: !105)
!112 = !DILocalVariable(name: "temp", scope: !96, file: !50, line: 183, type: !105)
!113 = !DILocalVariable(name: "isBoundary", scope: !96, file: !50, line: 185, type: !105)
!114 = !DILocalVariable(name: "isBulk", scope: !96, file: !50, line: 185, type: !105)
!115 = !DILocalVariable(name: "rhoi", scope: !96, file: !50, line: 187, type: !105)
!116 = !DILocalVariable(name: "scalar", scope: !96, file: !50, line: 187, type: !105)
!117 = !DILocalVariable(name: "temprhoi", scope: !96, file: !50, line: 187, type: !105)
!118 = !DILocalVariable(name: "tempi", scope: !96, file: !50, line: 187, type: !105)
!119 = !DILocalVariable(name: "theta", scope: !96, file: !50, line: 187, type: !105)
!120 = !DILocalVariable(name: "forcey", scope: !96, file: !50, line: 187, type: !105)
!121 = !DILocalVariable(name: "omeganow", scope: !96, file: !50, line: 187, type: !105)
