; RUN: opt -hir-ssa-deconstruction -hir-temp-cleanup -hir-general-unroll -print-after=hir-general-unroll -hir-cg -S < %s 2>&1 | FileCheck %s
; RUN: opt -passes="hir-ssa-deconstruction,hir-temp-cleanup,hir-general-unroll,print<hir>,hir-cg" -S < %s 2>&1 | FileCheck %s

; This test case was failing with "broken module" message because of corrupted metadata generated by HIR.

; CHECK: BEGIN REGION { modified }
; CHECK:   UNKNOWN LOOP i1 <nounroll>

; Check unroll disabling metadata
; CHECK: !llvm.loop [[LOOPMETADATA:!.*]]
; CHECK: [[LOOPMETADATA]] = distinct !{[[LOOPMETADATA]], [[NOUNROLL:!.*]]}
; CHECK: [[NOUNROLL]] = !{!"llvm.loop.unroll.disable"}


target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind readnone uwtable
define i32 @gcd(i32 %a, i32 %b) local_unnamed_addr #0 !dbg !180 {
entry:
  call void @llvm.dbg.value(metadata i32 %a, metadata !184, metadata !DIExpression()), !dbg !186
  call void @llvm.dbg.value(metadata i32 %b, metadata !185, metadata !DIExpression()), !dbg !187
  %cmp4 = icmp eq i32 %b, 0, !dbg !188
  br i1 %cmp4, label %return, label %if.end.preheader, !dbg !190

if.end.preheader:                                 ; preds = %entry
  br label %if.end, !dbg !191

if.end:                                           ; preds = %if.end, %if.end.preheader
  %b.tr6 = phi i32 [ %rem, %if.end ], [ %b, %if.end.preheader ]
  %a.tr5 = phi i32 [ %b.tr6, %if.end ], [ %a, %if.end.preheader ]
  call void @llvm.dbg.value(metadata i32 %b.tr6, metadata !185, metadata !DIExpression()), !dbg !187
  call void @llvm.dbg.value(metadata i32 %a.tr5, metadata !184, metadata !DIExpression()), !dbg !186
  %rem = srem i32 %a.tr5, %b.tr6, !dbg !191
  call void @llvm.dbg.value(metadata i32 %b.tr6, metadata !184, metadata !DIExpression()), !dbg !186
  call void @llvm.dbg.value(metadata i32 %rem, metadata !185, metadata !DIExpression()), !dbg !187
  %cmp = icmp eq i32 %rem, 0, !dbg !188
  br i1 %cmp, label %return.loopexit, label %if.end, !dbg !190

return.loopexit:                                  ; preds = %if.end
  %b.tr6.lcssa = phi i32 [ %b.tr6, %if.end ]
  call void @llvm.dbg.value(metadata i32 %b.tr6.lcssa, metadata !185, metadata !DIExpression()), !dbg !187
  br label %return, !dbg !192

return:                                           ; preds = %return.loopexit, %entry
  %a.tr.lcssa = phi i32 [ %a, %entry ], [ %b.tr6.lcssa, %return.loopexit ]
  call void @llvm.dbg.value(metadata i32 %a.tr.lcssa, metadata !184, metadata !DIExpression()), !dbg !186
  ret i32 %a.tr.lcssa, !dbg !192
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.value(metadata, metadata, metadata) #1

attributes #0 = { nounwind readnone uwtable "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "pre_loopopt" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone speculatable }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!174, !175, !176, !177}
!llvm.dbg.intel.emit_class_debug_always = !{!178}
!llvm.ident = !{!179}

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 7.0.0 (ssh://git-amr-2.devtools.intel.com:29418/dpd_icl-clang 65e8f9d46b54671e271ba934ab45010c98c98cce) (ssh://git-amr-2.devtools.intel.com:29418/dpd_icl-llvm 7bfbb0c98022ec8ddd715c23c7989203fc9e4dc6)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !2)
!1 = !DIFile(filename: "magic/src/puzzle.c", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "magic_api", file: !8, line: 157, baseType: !9)
!8 = !DIFile(filename: "src/tp_magic_api.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic_api_t", file: !8, line: 77, size: 1152, elements: !10)
!10 = !{!11, !14, !15, !19, !24, !36, !40, !44, !125, !129, !143, !144, !151, !155, !160, !164, !165, !166, !170}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version", scope: !9, file: !8, line: 79, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "data_directory", scope: !9, file: !8, line: 83, baseType: !12, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "update_progress_bar", scope: !9, file: !8, line: 86, baseType: !16, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "special_notify", scope: !9, file: !8, line: 89, baseType: !20, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{null, !23}
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sRGB_to_linear", scope: !9, file: !8, line: 92, baseType: !25, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29}
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint8", file: !30, line: 99, baseType: !31)
!30 = !DIFile(filename: "/usr/include/SDL/SDL_stdinc.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !33)
!32 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 37, baseType: !35)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "linear_to_sRGB", scope: !9, file: !8, line: 95, baseType: !37, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!29, !28}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "in_circle", scope: !9, file: !8, line: 100, baseType: !41, size: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!23, !23, !23, !23}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "getpixel", scope: !9, file: !8, line: 107, baseType: !45, size: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !51, !23, !23}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint32", file: !30, line: 103, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 41, baseType: !5)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDL_Surface", file: !53, line: 122, baseType: !54)
!53 = !DIFile(filename: "/usr/include/SDL/SDL_video.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_Surface", file: !53, line: 96, size: 704, elements: !55)
!55 = !{!56, !57, !93, !94, !95, !100, !101, !102, !105, !118, !119, !120, !123, !124}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !53, line: 97, baseType: !48, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !54, file: !53, line: 98, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDL_PixelFormat", file: !53, line: 91, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_PixelFormat", file: !53, line: 70, size: 384, elements: !61)
!61 = !{!62, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !60, file: !53, line: 71, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDL_Palette", file: !53, line: 66, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_Palette", file: !53, line: 63, size: 128, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !65, file: !53, line: 64, baseType: !23, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !65, file: !53, line: 65, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDL_Color", file: !53, line: 60, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_Color", file: !53, line: 55, size: 32, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !71, file: !53, line: 56, baseType: !29, size: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !71, file: !53, line: 57, baseType: !29, size: 8, offset: 8)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !71, file: !53, line: 58, baseType: !29, size: 8, offset: 16)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !71, file: !53, line: 59, baseType: !29, size: 8, offset: 24)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "BitsPerPixel", scope: !60, file: !53, line: 72, baseType: !29, size: 8, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "BytesPerPixel", scope: !60, file: !53, line: 73, baseType: !29, size: 8, offset: 72)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Rloss", scope: !60, file: !53, line: 74, baseType: !29, size: 8, offset: 80)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Gloss", scope: !60, file: !53, line: 75, baseType: !29, size: 8, offset: 88)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Bloss", scope: !60, file: !53, line: 76, baseType: !29, size: 8, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Aloss", scope: !60, file: !53, line: 77, baseType: !29, size: 8, offset: 104)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Rshift", scope: !60, file: !53, line: 78, baseType: !29, size: 8, offset: 112)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Gshift", scope: !60, file: !53, line: 79, baseType: !29, size: 8, offset: 120)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Bshift", scope: !60, file: !53, line: 80, baseType: !29, size: 8, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Ashift", scope: !60, file: !53, line: 81, baseType: !29, size: 8, offset: 136)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Rmask", scope: !60, file: !53, line: 82, baseType: !48, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Gmask", scope: !60, file: !53, line: 83, baseType: !48, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Bmask", scope: !60, file: !53, line: 84, baseType: !48, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Amask", scope: !60, file: !53, line: 85, baseType: !48, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "colorkey", scope: !60, file: !53, line: 88, baseType: !48, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !60, file: !53, line: 90, baseType: !29, size: 8, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !54, file: !53, line: 99, baseType: !23, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !54, file: !53, line: 99, baseType: !23, size: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !54, file: !53, line: 100, baseType: !96, size: 16, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint16", file: !30, line: 101, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 25, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !34, line: 39, baseType: !99)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !54, file: !53, line: 101, baseType: !4, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !54, file: !53, line: 102, baseType: !23, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hwdata", scope: !54, file: !53, line: 105, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "private_hwdata", file: !53, line: 105, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "clip_rect", scope: !54, file: !53, line: 108, baseType: !106, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDL_Rect", file: !53, line: 53, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_Rect", file: !53, line: 50, size: 64, elements: !108)
!108 = !{!109, !115, !116, !117}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !107, file: !53, line: 51, baseType: !110, size: 16)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sint16", file: !30, line: 100, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !112, line: 25, baseType: !113)
!112 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !34, line: 38, baseType: !114)
!114 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !107, file: !53, line: 51, baseType: !110, size: 16, offset: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !107, file: !53, line: 52, baseType: !96, size: 16, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !107, file: !53, line: 52, baseType: !96, size: 16, offset: 48)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "unused1", scope: !54, file: !53, line: 109, baseType: !48, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !54, file: !53, line: 112, baseType: !48, size: 32, offset: 544)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !54, file: !53, line: 115, baseType: !121, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "SDL_BlitMap", file: !53, line: 115, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "format_version", scope: !54, file: !53, line: 118, baseType: !5, size: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !54, file: !53, line: 121, baseType: !23, size: 32, offset: 672)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "putpixel", scope: !9, file: !8, line: 114, baseType: !126, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !51, !23, !23, !48}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "playsound", scope: !9, file: !8, line: 120, baseType: !130, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !23, !23}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mix_Chunk", file: !135, line: 107, baseType: !136)
!135 = !DIFile(filename: "/usr/include/SDL/SDL_mixer.h", directory: "/export/iusers/pchawla/ics/test/cmplrs-52188")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mix_Chunk", file: !135, line: 102, size: 192, elements: !137)
!137 = !{!138, !139, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !136, file: !135, line: 103, baseType: !23, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "abuf", scope: !136, file: !135, line: 104, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !136, file: !135, line: 105, baseType: !48, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !136, file: !135, line: 106, baseType: !29, size: 8, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stopsound", scope: !9, file: !8, line: 123, baseType: !16, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !9, file: !8, line: 130, baseType: !145, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !4, !23, !51, !51, !23, !23, !23, !23, !23, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !4, !23, !51, !51, !23, !23}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "button_down", scope: !9, file: !8, line: 133, baseType: !152, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!23}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rgbtohsv", scope: !9, file: !8, line: 136, baseType: !156, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !29, !29, !29, !159, !159, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "hsvtorgb", scope: !9, file: !8, line: 139, baseType: !161, size: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !28, !28, !28, !140, !140, !140}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "canvas_w", scope: !9, file: !8, line: 142, baseType: !23, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "canvas_h", scope: !9, file: !8, line: 143, baseType: !23, size: 32, offset: 992)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !9, file: !8, line: 149, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!51, !51, !23, !23, !23}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "touched", scope: !9, file: !8, line: 156, baseType: !171, size: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!29, !23, !23}
!174 = !{i32 2, !"Dwarf Version", i32 4}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{i32 7, !"PIC Level", i32 1}
!178 = !{!"true"}
!179 = !{!"clang version 7.0.0 (ssh://git-amr-2.devtools.intel.com:29418/dpd_icl-clang 65e8f9d46b54671e271ba934ab45010c98c98cce) (ssh://git-amr-2.devtools.intel.com:29418/dpd_icl-llvm 7bfbb0c98022ec8ddd715c23c7989203fc9e4dc6)"}
!180 = distinct !DISubprogram(name: "gcd", scope: !1, file: !1, line: 138, type: !181, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !183)
!181 = !DISubroutineType(types: !182)
!182 = !{!23, !23, !23}
!183 = !{!184, !185}
!184 = !DILocalVariable(name: "a", arg: 1, scope: !180, file: !1, line: 138, type: !23)
!185 = !DILocalVariable(name: "b", arg: 2, scope: !180, file: !1, line: 138, type: !23)
!186 = !DILocation(line: 138, column: 13, scope: !180)
!187 = !DILocation(line: 138, column: 20, scope: !180)
!188 = !DILocation(line: 140, column: 7, scope: !189)
!189 = distinct !DILexicalBlock(scope: !180, file: !1, line: 140, column: 6)
!190 = !DILocation(line: 140, column: 6, scope: !180)
!191 = !DILocation(line: 141, column: 17, scope: !180)
!192 = !DILocation(line: 142, column: 1, scope: !180)
