; Checks that IPO Prefetch pass can work properly even under the conditions that debug information is now available.
;
; [Note]
; There are 3 functions in this LIT test. Each function has multiple debug intrinsics (in form of llvm.dbg.value).
; When a program is compiled with "-g" or -qopt-report, debug info is generated.
; The IPO Prefetch pass is now working properly in presence of debug info.
;
;

; REQUIRES: asserts


; *** Run command section ***
; RUN: opt < %s -intel-ipoprefetch -ipo-prefetch-be-lit-friendly=1 -enable-intel-advanced-opts=1 -mtriple=i686-- -mattr=+avx2  -S 2>&1 | FileCheck %s
; RUN: opt < %s -passes='module(intel-ipoprefetch)' -ipo-prefetch-be-lit-friendly=1 -enable-intel-advanced-opts=1 -mtriple=i686-- -mattr=+avx2  -S 2>&1 | FileCheck %s
;

; *** Check section 1 ***
; The LLVM-IR check below ensure that a call to the Prefetch.Backbone function is inserted inside host
; _Z6searchP7state_tiiiii.
; CHECK: define internal i32 @_Z6searchP7state_tiiiii(%struct.state_t* %0, i32 %1, i32 %2, i32 %3, i32 %4, i32 %5) #5 !dbg [[DBG_0:![0-9]+]] {
; CHECK: call void @Prefetch.Backbone(%struct.state_t* %0), !dbg !1847
;

; *** Check section 2 ***
; The LLVM-IR check below ensure that a call to the Prefetch.Backbone function is inserted inside host
; _Z7qsearchP7state_tiiii.
; CHECK: define internal i32 @_Z7qsearchP7state_tiiii(%struct.state_t* %0, i32 %1, i32 %2, i32 %3, i32 %4) #5 !dbg [[DBG_0:![0-9]+]] {

!73 = distinct !DIGlobalVariable(name: "WhiteKingSide", scope: !2, file: !3, line: 86, type: !6, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "WhiteQueenSide", scope: !2, file: !3, line: 87, type: !6, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "BlackKingSide", scope: !2, file: !3, line: 88, type: !6, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "BlackQueenSide", scope: !2, file: !3, line: 89, type: !6, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "KingSafetyMask", scope: !2, file: !3, line: 90, type: !14, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "KingSafetyMask1", scope: !2, file: !3, line: 91, type: !14, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "WhiteStrongSquareMask", scope: !2, file: !3, line: 93, type: !6, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "BlackStrongSquareMask", scope: !2, file: !3, line: 94, type: !6, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "WhiteSqMask", scope: !2, file: !3, line: 96, type: !6, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "BlackSqMask", scope: !2, file: !3, line: 97, type: !6, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "KSMask", scope: !2, file: !3, line: 99, type: !6, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "QSMask", scope: !2, file: !3, line: 100, type: !6, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "KingFilesMask", scope: !2, file: !3, line: 102, type: !45, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "KingPressureMask", scope: !2, file: !3, line: 103, type: !14, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "KingPressureMask1", scope: !2, file: !3, line: 104, type: !14, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "CenterMask", scope: !2, file: !3, line: 105, type: !6, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "SpaceMask", scope: !2, file: !3, line: 106, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 2)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "DiagonalLength_a1h8", linkageName: "_ZL19DiagonalLength_a1h8", scope: !2, file: !3, line: 27, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 2048, elements: !15)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "DiagonalLength_a8h1", linkageName: "_ZL19DiagonalLength_a8h1", scope: !2, file: !3, line: 38, type: !111, isLocal: true, isDefinition: true)
!116 = !{!117, !122, !127, !134, !138, !142, !147, !156, !160, !164, !178, !182, !186, !190, !194, !199, !203, !207, !211, !215, !223, !227, !231, !235, !239, !243, !249, !253, !257, !259, !267, !271, !279, !281, !285, !289, !293, !297, !301, !306, !311, !312, !313, !314, !316, !317, !318, !319, !320, !321, !322, !326}
!117 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !118, entity: !119, file: !121, line: 56)
!118 = !DINamespace(name: "__gnu_debug", scope: null)
!119 = !DINamespace(name: "__debug", scope: !120)
!120 = !DINamespace(name: "std", scope: null)
!121 = !DIFile(filename: "/nfs/sc/proj/icl/rdrive/ref/gcc/5.5.0/rhel70/efi2/bin/../include/c++/5.5.0/debug/debug.h", directory: "")
!122 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !123, file: !126, line: 118)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !124, line: 101, baseType: !125)
!124 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!126 = !DIFile(filename: "/nfs/sc/proj/icl/rdrive/ref/gcc/5.5.0/rhel70/efi2/bin/../include/c++/5.5.0/cstdlib", directory: "")
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !128, file: !126, line: 119)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !124, line: 109, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 105, size: 128, flags: DIFlagTypePassByValue, elements: !130, identifier: "_ZTS6ldiv_t")
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !129, file: !124, line: 107, baseType: !132, size: 64)
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !129, file: !124, line: 108, baseType: !132, size: 64, offset: 64)
!134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !135, file: !126, line: 121)
!135 = !DISubprogram(name: "abort", scope: !124, file: !124, line: 514, type: !136, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !139, file: !126, line: 122)
!139 = !DISubprogram(name: "abs", scope: !124, file: !124, line: 770, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{!113, !113}
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !143, file: !126, line: 123)
!143 = !DISubprogram(name: "atexit", scope: !124, file: !124, line: 518, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{!113, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !148, file: !126, line: 129)
!148 = !DISubprogram(name: "atof", scope: !149, file: !149, line: 26, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "")
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !153}
!152 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !157, file: !126, line: 130)
!157 = !DISubprogram(name: "atoi", scope: !124, file: !124, line: 278, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!113, !153}
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !161, file: !126, line: 131)
!161 = !DISubprogram(name: "atol", scope: !124, file: !124, line: 283, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubroutineType(types: !163)
!163 = !{!132, !153}
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !165, file: !126, line: 132)
!165 = !DISubprogram(name: "bsearch", scope: !124, file: !124, line: 754, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !169, !169, !171, !171, !174}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !172, line: 51, baseType: !173)
!172 = !DIFile(filename: "XMAIN/deploy/linux_debug/lib/clang/10.0.0/include/stddef.h", directory: "/export/iusers/cczhao/Workspaces")
!173 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !124, line: 741, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!113, !169, !169}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !179, file: !126, line: 133)
!179 = !DISubprogram(name: "calloc", scope: !124, file: !124, line: 467, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!168, !171, !171}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !183, file: !126, line: 134)
!183 = !DISubprogram(name: "div", scope: !124, file: !124, line: 784, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubroutineType(types: !185)
!185 = !{!123, !113, !113}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !187, file: !126, line: 135)
!187 = !DISubprogram(name: "exit", scope: !124, file: !124, line: 542, type: !188, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !113}
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !191, file: !126, line: 136)
!191 = !DISubprogram(name: "free", scope: !124, file: !124, line: 482, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !168}
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !195, file: !126, line: 137)
!195 = !DISubprogram(name: "getenv", scope: !124, file: !124, line: 563, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !153}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !200, file: !126, line: 138)
!200 = !DISubprogram(name: "labs", scope: !124, file: !124, line: 771, type: !201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubroutineType(types: !202)
!202 = !{!132, !132}
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !204, file: !126, line: 139)
!204 = !DISubprogram(name: "ldiv", scope: !124, file: !124, line: 786, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{!128, !132, !132}
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !208, file: !126, line: 140)
!208 = !DISubprogram(name: "malloc", scope: !124, file: !124, line: 465, type: !209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DISubroutineType(types: !210)
!210 = !{!168, !171}
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !212, file: !126, line: 142)
!212 = !DISubprogram(name: "mblen", scope: !124, file: !124, line: 859, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{!113, !153, !171}
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !216, file: !126, line: 143)
!216 = !DISubprogram(name: "mbstowcs", scope: !124, file: !124, line: 870, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{!171, !219, !222, !171}
!219 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !153)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !224, file: !126, line: 144)
!224 = !DISubprogram(name: "mbtowc", scope: !124, file: !124, line: 862, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{!113, !219, !222, !171}
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !228, file: !126, line: 146)
!228 = !DISubprogram(name: "qsort", scope: !124, file: !124, line: 760, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !168, !171, !171, !174}
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !232, file: !126, line: 152)
!232 = !DISubprogram(name: "rand", scope: !124, file: !124, line: 374, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!113}
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !236, file: !126, line: 153)
!236 = !DISubprogram(name: "realloc", scope: !124, file: !124, line: 479, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{!168, !168, !171}
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !240, file: !126, line: 154)
!240 = !DISubprogram(name: "srand", scope: !124, file: !124, line: 376, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !10}
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !244, file: !126, line: 155)
!244 = !DISubprogram(name: "strtod", scope: !124, file: !124, line: 164, type: !245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubroutineType(types: !246)
!246 = !{!152, !222, !247}
!247 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !250, file: !126, line: 156)
!250 = !DISubprogram(name: "strtol", scope: !124, file: !124, line: 183, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!251 = !DISubroutineType(types: !252)
!252 = !{!132, !222, !247, !113}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !254, file: !126, line: 157)
!254 = !DISubprogram(name: "strtoul", scope: !124, file: !124, line: 187, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!173, !222, !247, !113}
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !258, file: !126, line: 158)
!258 = !DISubprogram(name: "system", scope: !124, file: !124, line: 716, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !260, file: !126, line: 160)
!260 = !DISubprogram(name: "wcstombs", scope: !124, file: !124, line: 873, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!171, !263, !264, !171}
!263 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !198)
!264 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !268, file: !126, line: 161)
!268 = !DISubprogram(name: "wctomb", scope: !124, file: !124, line: 866, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!113, !198, !221}
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !273, file: !126, line: 214)
!272 = !DINamespace(name: "__gnu_cxx", scope: null)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !124, line: 121, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 117, size: 128, flags: DIFlagTypePassByValue, elements: !275, identifier: "_ZTS7lldiv_t")
!275 = !{!276, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !274, file: !124, line: 119, baseType: !277, size: 64)
!277 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !274, file: !124, line: 120, baseType: !277, size: 64, offset: 64)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !280, file: !126, line: 220)
!280 = !DISubprogram(name: "_Exit", scope: !124, file: !124, line: 556, type: !188, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !282, file: !126, line: 224)
!282 = !DISubprogram(name: "llabs", scope: !124, file: !124, line: 775, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!277, !277}
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !286, file: !126, line: 230)
!286 = !DISubprogram(name: "lldiv", scope: !124, file: !124, line: 792, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DISubroutineType(types: !288)
!288 = !{!273, !277, !277}
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !290, file: !126, line: 241)
!290 = !DISubprogram(name: "atoll", scope: !124, file: !124, line: 292, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{!277, !153}
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !294, file: !126, line: 242)
!294 = !DISubprogram(name: "strtoll", scope: !124, file: !124, line: 209, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DISubroutineType(types: !296)
!296 = !{!277, !222, !247, !113}
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !298, file: !126, line: 243)
!298 = !DISubprogram(name: "strtoull", scope: !124, file: !124, line: 214, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!299 = !DISubroutineType(types: !300)
!300 = !{!8, !222, !247, !113}
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !302, file: !126, line: 245)
!302 = !DISubprogram(name: "strtof", scope: !124, file: !124, line: 172, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !222, !247}
!305 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !307, file: !126, line: 246)
!307 = !DISubprogram(name: "strtold", scope: !124, file: !124, line: 175, type: !308, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !222, !247}
!310 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !273, file: !126, line: 254)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !280, file: !126, line: 256)
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !282, file: !126, line: 258)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !315, file: !126, line: 259)
!315 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !272, file: !126, line: 227, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !286, file: !126, line: 260)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !290, file: !126, line: 262)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !302, file: !126, line: 263)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !294, file: !126, line: 264)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !298, file: !126, line: 265)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !120, entity: !307, file: !126, line: 266)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !323, file: !325, line: 44)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !120, file: !324, line: 199, baseType: !173)
!324 = !DIFile(filename: "/nfs/sc/proj/icl/rdrive/ref/gcc/5.5.0/rhel70/efi2/bin/../include/c++/5.5.0/x86_64-linux-gnu/bits/c++config.h", directory: "")
!325 = !DIFile(filename: "/nfs/sc/proj/icl/rdrive/ref/gcc/5.5.0/rhel70/efi2/bin/../include/c++/5.5.0/ext/new_allocator.h", directory: "")
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !327, file: !325, line: 45)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !120, file: !324, line: 200, baseType: !132)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "last_bit", scope: !330, file: !331, line: 55, type: !338, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !331, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !234, globals: !332, nameTableKind: None)
!331 = !DIFile(filename: "bits.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!332 = !{!333, !328, !336}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression(DW_OP_constu, 283881067100198605, DW_OP_stack_value))
!334 = distinct !DIGlobalVariable(name: "magic", scope: !330, file: !331, line: 29, type: !335, isLocal: true, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "magictable", linkageName: "_ZL10magictable", scope: !330, file: !331, line: 30, type: !111, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 524288, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 65536)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "rankoffsets", scope: !343, file: !344, line: 24, type: !492, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "setup_epd_line", linkageName: "_Z14setup_epd_lineP11gamestate_tP7state_tPKc", scope: !344, file: !344, line: 23, type: !345, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !446, retainedNodes: !493)
!344 = !DIFile(filename: "epd.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347, !391, !153}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gamestate_t", file: !349, line: 72, size: 288832, flags: DIFlagTypePassByValue, elements: !350, identifier: "_ZTS11gamestate_t")
!349 = !DIFile(filename: "./state.h", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !372, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cur_score", scope: !348, file: !349, line: 73, baseType: !113, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !348, file: !349, line: 74, baseType: !113, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "root_to_move", scope: !348, file: !349, line: 75, baseType: !113, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "comp_color", scope: !348, file: !349, line: 76, baseType: !113, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !348, file: !349, line: 76, baseType: !113, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_depth", scope: !348, file: !349, line: 76, baseType: !113, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "moves_to_tc", scope: !348, file: !349, line: 77, baseType: !113, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "min_per_game", scope: !348, file: !349, line: 77, baseType: !113, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sec_per_game", scope: !348, file: !349, line: 77, baseType: !113, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "inc", scope: !348, file: !349, line: 77, baseType: !113, size: 32, offset: 288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "time_left", scope: !348, file: !349, line: 78, baseType: !113, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "opp_time", scope: !348, file: !349, line: 78, baseType: !113, size: 32, offset: 352)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "time_for_move", scope: !348, file: !349, line: 78, baseType: !113, size: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_time", scope: !348, file: !349, line: 79, baseType: !113, size: 32, offset: 416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "maxdepth", scope: !348, file: !349, line: 80, baseType: !113, size: 32, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "move_number", scope: !348, file: !349, line: 82, baseType: !113, size: 32, offset: 480)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "game_history", scope: !348, file: !349, line: 83, baseType: !368, size: 32000, offset: 512)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 32000, elements: !370)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !7, line: 121, baseType: !113)
!370 = !{!371}
!371 = !DISubrange(count: 1000)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "game_history_x", scope: !348, file: !349, line: 84, baseType: !373, size: 256000, offset: 32512)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 256000, elements: !370)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !7, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !375, identifier: "_ZTS6move_x")
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !374, file: !7, line: 131, baseType: !113, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !374, file: !7, line: 132, baseType: !113, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !374, file: !7, line: 133, baseType: !113, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !374, file: !7, line: 134, baseType: !113, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !374, file: !7, line: 135, baseType: !6, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !374, file: !7, line: 136, baseType: !6, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pvnodecount", scope: !348, file: !349, line: 85, baseType: !6, size: 64, offset: 288512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !348, file: !349, line: 86, baseType: !113, size: 32, offset: 288576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pv_best", scope: !348, file: !349, line: 88, baseType: !10, size: 32, offset: 288608)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "legals", scope: !348, file: !349, line: 89, baseType: !113, size: 32, offset: 288640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !348, file: !349, line: 90, baseType: !113, size: 32, offset: 288672)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "failedhigh", scope: !348, file: !349, line: 91, baseType: !113, size: 32, offset: 288704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "extendedtime", scope: !348, file: !349, line: 92, baseType: !113, size: 32, offset: 288736)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "time_exit", scope: !348, file: !349, line: 93, baseType: !113, size: 32, offset: 288768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "time_failure", scope: !348, file: !349, line: 93, baseType: !113, size: 32, offset: 288800)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !349, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !393, identifier: "_ZTS7state_t")
!393 = !{!394, !395, !397, !398, !399, !400, !404, !405, !406, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !419, !421, !422, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !392, file: !349, line: 13, baseType: !113, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !392, file: !349, line: 15, baseType: !396, size: 2048, offset: 32)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, elements: !15)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !392, file: !349, line: 16, baseType: !6, size: 64, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !392, file: !349, line: 17, baseType: !6, size: 64, offset: 2176)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !392, file: !349, line: 17, baseType: !6, size: 64, offset: 2240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !392, file: !349, line: 18, baseType: !401, size: 832, offset: 2304)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 13)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !392, file: !349, line: 20, baseType: !113, size: 32, offset: 3136)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !392, file: !349, line: 21, baseType: !113, size: 32, offset: 3168)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !392, file: !349, line: 22, baseType: !407, size: 416, offset: 3200)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 416, elements: !402)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !392, file: !349, line: 23, baseType: !113, size: 32, offset: 3616)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !392, file: !349, line: 25, baseType: !113, size: 32, offset: 3648)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !392, file: !349, line: 25, baseType: !113, size: 32, offset: 3680)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !392, file: !349, line: 25, baseType: !113, size: 32, offset: 3712)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !392, file: !349, line: 25, baseType: !113, size: 32, offset: 3744)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !392, file: !349, line: 26, baseType: !113, size: 32, offset: 3776)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !392, file: !349, line: 26, baseType: !113, size: 32, offset: 3808)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !392, file: !349, line: 28, baseType: !6, size: 64, offset: 3840)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !392, file: !349, line: 29, baseType: !6, size: 64, offset: 3904)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !392, file: !349, line: 31, baseType: !418, size: 16384, offset: 3968)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 16384, elements: !15)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !392, file: !349, line: 32, baseType: !420, size: 2048, offset: 20352)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 2048, elements: !15)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !392, file: !349, line: 33, baseType: !396, size: 2048, offset: 22400)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !392, file: !349, line: 41, baseType: !423, size: 8192, offset: 24448)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 8192, elements: !15)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !349, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !425, identifier: "_ZTSN7state_tUt_E")
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !424, file: !349, line: 37, baseType: !369, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !424, file: !349, line: 38, baseType: !369, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !424, file: !349, line: 39, baseType: !369, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !424, file: !349, line: 40, baseType: !369, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !392, file: !349, line: 43, baseType: !6, size: 64, offset: 32640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !392, file: !349, line: 43, baseType: !6, size: 64, offset: 32704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !392, file: !349, line: 44, baseType: !113, size: 32, offset: 32768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !392, file: !349, line: 45, baseType: !396, size: 2048, offset: 32800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !392, file: !349, line: 51, baseType: !10, size: 32, offset: 34848)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !392, file: !349, line: 52, baseType: !10, size: 32, offset: 34880)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !392, file: !349, line: 53, baseType: !10, size: 32, offset: 34912)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !392, file: !349, line: 54, baseType: !10, size: 32, offset: 34944)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !392, file: !349, line: 60, baseType: !113, size: 32, offset: 34976)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !392, file: !349, line: 61, baseType: !113, size: 32, offset: 35008)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !392, file: !349, line: 62, baseType: !113, size: 32, offset: 35040)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !392, file: !349, line: 63, baseType: !113, size: 32, offset: 35072)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !392, file: !349, line: 64, baseType: !113, size: 32, offset: 35104)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !392, file: !349, line: 65, baseType: !113, size: 32, offset: 35136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !392, file: !349, line: 69, baseType: !445, size: 64000, offset: 35200)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64000, elements: !370)
!446 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !344, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !463, globals: !465, nameTableKind: None)
!447 = !{!448}
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 47, baseType: !10, size: 32, elements: !450)
!449 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!451 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!452 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!453 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!454 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!455 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!456 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!457 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!458 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!459 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!462 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!463 = !{!113, !305, !464, !248}
!464 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!465 = !{!341, !466, !485, !490}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "xlate", scope: !468, file: !344, line: 384, type: !482, isLocal: true, isDefinition: true)
!468 = distinct !DISubprogram(name: "position_to_fen", linkageName: "_Z15position_to_fenP7state_tPc", scope: !344, file: !344, line: 383, type: !469, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !446, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !391, !198}
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480}
!472 = !DILocalVariable(name: "s", arg: 1, scope: !468, file: !344, line: 383, type: !391)
!473 = !DILocalVariable(name: "fen", arg: 2, scope: !468, file: !344, line: 383, type: !198)
!474 = !DILocalVariable(name: "xrank", scope: !468, file: !344, line: 387, type: !113)
!475 = !DILocalVariable(name: "xfile", scope: !468, file: !344, line: 387, type: !113)
!476 = !DILocalVariable(name: "nempty", scope: !468, file: !344, line: 387, type: !113)
!477 = !DILocalVariable(name: "thissq", scope: !468, file: !344, line: 387, type: !113)
!478 = !DILocalVariable(name: "castflag", scope: !468, file: !344, line: 388, type: !113)
!479 = !DILocalVariable(name: "c", scope: !468, file: !344, line: 389, type: !198)
!480 = !DILocalVariable(name: "sboard", scope: !468, file: !344, line: 391, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 112, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 14)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "str_empty", scope: !468, file: !344, line: 385, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 72, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 9)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "rankoffsets", scope: !468, file: !344, line: 386, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !46)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!494 = !DILocalVariable(name: "g", arg: 1, scope: !343, file: !344, line: 23, type: !347)
!495 = !DILocalVariable(name: "s", arg: 2, scope: !343, file: !344, line: 23, type: !391)
!496 = !DILocalVariable(name: "inbuff", arg: 3, scope: !343, file: !344, line: 23, type: !153)
!497 = !DILocalVariable(name: "stage", scope: !343, file: !344, line: 37, type: !113)
!498 = !DILocalVariable(name: "i", scope: !343, file: !344, line: 39, type: !113)
!499 = !DILocalVariable(name: "j", scope: !343, file: !344, line: 40, type: !113)
!500 = !DILocalVariable(name: "curr_rank", scope: !343, file: !344, line: 41, type: !113)
!501 = !DILocalVariable(name: "fileoffset", scope: !343, file: !344, line: 42, type: !113)
!502 = !DILocalVariable(name: "rankoffset", scope: !343, file: !344, line: 43, type: !113)
!503 = !DILocalVariable(name: "castlefile", scope: !343, file: !344, line: 44, type: !113)
!504 = !DILocalVariable(name: "castlesq", scope: !343, file: !344, line: 45, type: !113)
!505 = !DILocalVariable(name: "ep_file", scope: !343, file: !344, line: 47, type: !113)
!506 = !DILocalVariable(name: "ep_rank", scope: !343, file: !344, line: 47, type: !113)
!507 = !DILocalVariable(name: "norm_file", scope: !343, file: !344, line: 47, type: !113)
!508 = !DILocalVariable(name: "norm_rank", scope: !343, file: !344, line: 47, type: !113)
!509 = !DILocalVariable(name: "foundflags", scope: !343, file: !344, line: 48, type: !113)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "w_passer", linkageName: "_ZL8w_passer", scope: !512, file: !513, line: 39, type: !520, isLocal: true, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !513, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !514, imports: !116, nameTableKind: None)
!513 = !DIFile(filename: "neval.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!514 = !{!515, !510, !518, !523, !525, !527, !529}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "material", scope: !512, file: !513, line: 30, type: !517, isLocal: false, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 448, elements: !483)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "w_passer_pawn_supported", linkageName: "_ZL23w_passer_pawn_supported", scope: !512, file: !513, line: 59, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 192, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 6)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "w_passer_king_supported", linkageName: "_ZL23w_passer_king_supported", scope: !512, file: !513, line: 51, type: !520, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "w_passer_free", linkageName: "_ZL13w_passer_free", scope: !512, file: !513, line: 43, type: !520, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "w_passer_very_free", linkageName: "_ZL18w_passer_very_free", scope: !512, file: !513, line: 47, type: !520, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "w_passer_blocked", linkageName: "_ZL16w_passer_blocked", scope: !512, file: !513, line: 55, type: !520, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "PawnTT", linkageName: "_ZL6PawnTT", scope: !533, file: !534, line: 30, type: !539, isLocal: true, isDefinition: true)
!533 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !534, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !535, globals: !536, nameTableKind: None)
!534 = !DIFile(filename: "pawn.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!535 = !{!10}
!536 = !{!531, !537}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "w_candidate", linkageName: "_ZL11w_candidate", scope: !533, file: !534, line: 23, type: !520, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 92274688, elements: !555)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pawntt_t", file: !541, line: 7, size: 704, flags: DIFlagTypePassByValue, elements: !542, identifier: "_ZTS8pawntt_t")
!541 = !DIFile(filename: "./pawn.h", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !540, file: !541, line: 8, baseType: !6, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !540, file: !541, line: 9, baseType: !6, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "w_half_open_files", scope: !540, file: !541, line: 10, baseType: !6, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_half_open_files", scope: !540, file: !541, line: 11, baseType: !6, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "w_passed", scope: !540, file: !541, line: 12, baseType: !6, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_passed", scope: !540, file: !541, line: 13, baseType: !6, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "w_strong_square", scope: !540, file: !541, line: 14, baseType: !6, size: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_strong_square", scope: !540, file: !541, line: 15, baseType: !6, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "w_super_strong_square", scope: !540, file: !541, line: 16, baseType: !6, size: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "b_super_strong_square", scope: !540, file: !541, line: 17, baseType: !6, size: 64, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "w_score", scope: !540, file: !541, line: 19, baseType: !113, size: 32, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_score", scope: !540, file: !541, line: 20, baseType: !113, size: 32, offset: 672)
!555 = !{!31, !556}
!556 = !DISubrange(count: 16384)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "psq_king_nopawn", linkageName: "_ZL15psq_king_nopawn", scope: !559, file: !560, line: 39, type: !111, isLocal: true, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !560, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !561, nameTableKind: None)
!560 = !DIFile(filename: "preproc.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!561 = !{!562, !568, !570, !572, !574, !557, !576, !578, !580, !582, !584}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "psq_table", scope: !559, file: !560, line: 20, type: !564, isLocal: false, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 6144, elements: !566)
!565 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!566 = !{!567, !16}
!567 = !DISubrange(count: 12)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "flip", scope: !559, file: !560, line: 25, type: !111, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "wking_psq_end", linkageName: "_ZL13wking_psq_end", scope: !559, file: !560, line: 83, type: !111, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "psq_king_kingside", linkageName: "_ZL17psq_king_kingside", scope: !559, file: !560, line: 50, type: !111, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "psq_king_queenside", linkageName: "_ZL18psq_king_queenside", scope: !559, file: !560, line: 61, type: !111, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "wpawn_psq", linkageName: "_ZL9wpawn_psq", scope: !559, file: !560, line: 127, type: !111, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "wknight_psq_end", linkageName: "_ZL15wknight_psq_end", scope: !559, file: !560, line: 72, type: !111, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "wbishop_psq_end", linkageName: "_ZL15wbishop_psq_end", scope: !559, file: !560, line: 105, type: !111, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "wrook_psq_end", linkageName: "_ZL13wrook_psq_end", scope: !559, file: !560, line: 94, type: !111, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "wqueen_psq_end", linkageName: "_ZL14wqueen_psq_end", scope: !559, file: !560, line: 116, type: !111, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "history_hit", scope: !588, file: !589, line: 41, type: !594, isLocal: false, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !589, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !590, globals: !591, imports: !116, nameTableKind: None)
!589 = !DIFile(filename: "search.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!590 = !{!6, !113, !305}
!591 = !{!592, !586, !596, !598, !639, !641, !666}
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "history_h", scope: !588, file: !589, line: 40, type: !594, isLocal: false, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 196608, elements: !595)
!595 = !{!31, !567, !16}
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "history_tot", scope: !588, file: !589, line: 42, type: !594, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "changes", scope: !600, file: !589, line: 1328, type: !113, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "search_root", linkageName: "_Z11search_rootP7state_tiii", scope: !589, file: !589, line: 1316, type: !601, scopeLine: 1316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!369, !391, !113, !113, !113}
!603 = !{!604, !605, !606, !607, !608, !612, !613, !614, !615, !616, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !634, !635}
!604 = !DILocalVariable(name: "s", arg: 1, scope: !600, file: !589, line: 1316, type: !391)
!605 = !DILocalVariable(name: "originalalpha", arg: 2, scope: !600, file: !589, line: 1316, type: !113)
!606 = !DILocalVariable(name: "originalbeta", arg: 3, scope: !600, file: !589, line: 1316, type: !113)
!607 = !DILocalVariable(name: "depth", arg: 4, scope: !600, file: !589, line: 1316, type: !113)
!608 = !DILocalVariable(name: "moves", scope: !600, file: !589, line: 1317, type: !609)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 7680, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 240)
!612 = !DILocalVariable(name: "best_move", scope: !600, file: !589, line: 1317, type: !369)
!613 = !DILocalVariable(name: "num_moves", scope: !600, file: !589, line: 1318, type: !113)
!614 = !DILocalVariable(name: "i", scope: !600, file: !589, line: 1318, type: !113)
!615 = !DILocalVariable(name: "root_score", scope: !600, file: !589, line: 1319, type: !113)
!616 = !DILocalVariable(name: "move_ordering", scope: !600, file: !589, line: 1319, type: !617)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 7680, elements: !610)
!618 = !DILocalVariable(name: "no_moves", scope: !600, file: !589, line: 1320, type: !113)
!619 = !DILocalVariable(name: "legal_move", scope: !600, file: !589, line: 1320, type: !113)
!620 = !DILocalVariable(name: "first", scope: !600, file: !589, line: 1320, type: !113)
!621 = !DILocalVariable(name: "alpha", scope: !600, file: !589, line: 1321, type: !113)
!622 = !DILocalVariable(name: "beta", scope: !600, file: !589, line: 1321, type: !113)
!623 = !DILocalVariable(name: "dummy", scope: !600, file: !589, line: 1322, type: !113)
!624 = !DILocalVariable(name: "dummy2", scope: !600, file: !589, line: 1323, type: !10)
!625 = !DILocalVariable(name: "incheck", scope: !600, file: !589, line: 1324, type: !113)
!626 = !DILocalVariable(name: "mc", scope: !600, file: !589, line: 1325, type: !113)
!627 = !DILocalVariable(name: "oldnodecount", scope: !600, file: !589, line: 1326, type: !6)
!628 = !DILocalVariable(name: "extend", scope: !600, file: !589, line: 1327, type: !113)
!629 = !DILocalVariable(name: "huber", scope: !600, file: !589, line: 1327, type: !113)
!630 = !DILocalVariable(name: "searching_move", scope: !600, file: !589, line: 1330, type: !631)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 4096, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 512)
!634 = !DILocalVariable(name: "movetotal", scope: !600, file: !589, line: 1358, type: !113)
!635 = !DILocalVariable(name: "moveleft", scope: !636, file: !589, line: 1389, type: !113)
!636 = distinct !DILexicalBlock(scope: !637, file: !589, line: 1385, column: 39)
!637 = distinct !DILexicalBlock(scope: !638, file: !589, line: 1385, column: 13)
!638 = distinct !DILexicalBlock(scope: !600, file: !589, line: 1374, column: 66)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "bmove", scope: !600, file: !589, line: 1329, type: !369, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "lastsearchscore", scope: !643, file: !589, line: 1638, type: !113, isLocal: true, isDefinition: true)
!643 = distinct !DISubprogram(name: "think", linkageName: "_Z5thinkP11gamestate_tP7state_t", scope: !589, file: !589, line: 1629, type: !644, scopeLine: 1629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !646)
!644 = !DISubroutineType(types: !645)
!645 = !{!369, !347, !391}
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!647 = !DILocalVariable(name: "g", arg: 1, scope: !643, file: !589, line: 1629, type: !347)
!648 = !DILocalVariable(name: "s", arg: 2, scope: !643, file: !589, line: 1629, type: !391)
!649 = !DILocalVariable(name: "comp_move", scope: !643, file: !589, line: 1630, type: !369)
!650 = !DILocalVariable(name: "temp_move", scope: !643, file: !589, line: 1630, type: !369)
!651 = !DILocalVariable(name: "elapsed", scope: !643, file: !589, line: 1631, type: !113)
!652 = !DILocalVariable(name: "temp_score", scope: !643, file: !589, line: 1631, type: !113)
!653 = !DILocalVariable(name: "output", scope: !643, file: !589, line: 1632, type: !631)
!654 = !DILocalVariable(name: "output2", scope: !643, file: !589, line: 1632, type: !631)
!655 = !DILocalVariable(name: "alpha", scope: !643, file: !589, line: 1633, type: !113)
!656 = !DILocalVariable(name: "beta", scope: !643, file: !589, line: 1633, type: !113)
!657 = !DILocalVariable(name: "rs", scope: !643, file: !589, line: 1634, type: !113)
!658 = !DILocalVariable(name: "moves", scope: !643, file: !589, line: 1635, type: !609)
!659 = !DILocalVariable(name: "l", scope: !643, file: !589, line: 1636, type: !113)
!660 = !DILocalVariable(name: "lastlegal", scope: !643, file: !589, line: 1636, type: !113)
!661 = !DILocalVariable(name: "ic", scope: !643, file: !589, line: 1636, type: !113)
!662 = !DILocalVariable(name: "num_moves", scope: !643, file: !589, line: 1637, type: !113)
!663 = !DILocalVariable(name: "true_i_depth", scope: !643, file: !589, line: 1639, type: !113)
!664 = !DILocalVariable(name: "pondermove", scope: !643, file: !589, line: 1640, type: !369)
!665 = !DILocalVariable(name: "legals", scope: !643, file: !589, line: 1651, type: !113)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "rc_index", linkageName: "_ZL8rc_index", scope: !588, file: !589, line: 36, type: !517, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "contempt", scope: !670, file: !671, line: 38, type: !113, isLocal: false, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !671, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !672, nameTableKind: None)
!671 = !DIFile(filename: "sjeng.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!672 = !{!673, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !701, !703, !705, !668, !707, !709, !711, !713}
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "buffered_command", scope: !670, file: !671, line: 25, type: !675, isLocal: false, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1310720, elements: !676)
!676 = !{!677, !678}
!677 = !DISubrange(count: 20)
!678 = !DISubrange(count: 8192)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "buffered_count", scope: !670, file: !671, line: 26, type: !113, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "is_pondering", scope: !670, file: !671, line: 27, type: !113, isLocal: false, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "allow_pondering", scope: !670, file: !671, line: 27, type: !113, isLocal: false, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "is_analyzing", scope: !670, file: !671, line: 27, type: !113, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "TTSize", scope: !670, file: !671, line: 28, type: !10, isLocal: false, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "uci_mode", scope: !670, file: !671, line: 29, type: !113, isLocal: false, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "uci_chess960_mode", scope: !670, file: !671, line: 30, type: !113, isLocal: false, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "uci_showcurrline", scope: !670, file: !671, line: 31, type: !113, isLocal: false, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "uci_showrefutations", scope: !670, file: !671, line: 32, type: !113, isLocal: false, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "uci_limitstrength", scope: !670, file: !671, line: 33, type: !113, isLocal: false, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "uci_elo", scope: !670, file: !671, line: 34, type: !113, isLocal: false, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "uci_multipv", scope: !670, file: !671, line: 35, type: !113, isLocal: false, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "cfg_logging", scope: !670, file: !671, line: 36, type: !113, isLocal: false, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "cfg_logfile", scope: !670, file: !671, line: 37, type: !631, isLocal: false, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "time_check_log", scope: !670, file: !671, line: 39, type: !113, isLocal: false, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "global_id", scope: !670, file: !671, line: 40, type: !113, isLocal: false, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "EGTBHits", scope: !670, file: !671, line: 41, type: !113, isLocal: false, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "EGTBProbes", scope: !670, file: !671, line: 42, type: !113, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "state", scope: !717, file: !718, line: 16, type: !392, isLocal: false, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !718, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !719, nameTableKind: None)
!718 = !DIFile(filename: "state.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!719 = !{!715, !720, !722}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "gamestate", scope: !717, file: !718, line: 17, type: !348, isLocal: false, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "scoreboard", scope: !717, file: !718, line: 18, type: !724, isLocal: false, isDefinition: true)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scoreboard_t", file: !349, line: 96, size: 794688, flags: DIFlagTypePassByValue, elements: !725, identifier: "_ZTS12scoreboard_t")
!725 = !{!726, !727, !729, !736, !738}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !724, file: !349, line: 97, baseType: !113, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !724, file: !349, line: 98, baseType: !728, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "searchstart", scope: !724, file: !349, line: 103, baseType: !730, size: 768, offset: 64)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 768, elements: !46)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !349, line: 99, size: 96, flags: DIFlagTypePassByValue, elements: !732, identifier: "_ZTSN12scoreboard_tUt_E")
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !731, file: !349, line: 100, baseType: !113, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !731, file: !349, line: 101, baseType: !113, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !731, file: !349, line: 102, baseType: !113, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !724, file: !349, line: 104, baseType: !737, size: 256, offset: 832)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 256, elements: !46)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "threadstate", scope: !724, file: !349, line: 105, baseType: !739, size: 793600, offset: 1088)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 793600, elements: !46)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "TTable", scope: !742, file: !743, line: 19, type: !745, isLocal: false, isDefinition: true)
!742 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !743, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !744, globals: !763, nameTableKind: None)
!743 = !DIFile(filename: "ttable.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!744 = !{!6, !10, !113, !745, !171}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ttentry_t", file: !747, line: 22, size: 384, flags: DIFlagTypePassByValue, elements: !748, identifier: "_ZTS9ttentry_t")
!747 = !DIFile(filename: "./ttable.h", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !746, file: !747, line: 23, baseType: !750, size: 384)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 384, elements: !66)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ttbucket_t", file: !747, line: 10, size: 96, flags: DIFlagTypePassByValue, elements: !752, identifier: "_ZTS10ttbucket_t")
!752 = !{!753, !754, !756, !757, !758, !759, !760, !761, !762}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !751, file: !747, line: 11, baseType: !10, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !751, file: !747, line: 12, baseType: !755, size: 16, offset: 32)
!755 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bestmove", scope: !751, file: !747, line: 13, baseType: !464, size: 16, offset: 48)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !751, file: !747, line: 14, baseType: !9, size: 8, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "threat", scope: !751, file: !747, line: 15, baseType: !9, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 72)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !747, line: 16, baseType: !9, size: 2, offset: 73, flags: DIFlagBitField, extraData: i64 72)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "singular", scope: !751, file: !747, line: 17, baseType: !9, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 72)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nosingular", scope: !751, file: !747, line: 18, baseType: !9, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 72)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !751, file: !747, line: 19, baseType: !9, size: 2, offset: 77, flags: DIFlagBitField, extraData: i64 72)
!763 = !{!764, !740, !768}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "zobrist", scope: !742, file: !743, line: 17, type: !766, isLocal: false, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 57344, elements: !767)
!767 = !{!484, !16}
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "TTAge", scope: !742, file: !743, line: 20, type: !10, isLocal: false, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "init_board", scope: !772, file: !773, line: 401, type: !111, isLocal: true, isDefinition: true)
!772 = distinct !DISubprogram(name: "init_game", linkageName: "_Z9init_gameP11gamestate_tP7state_t", scope: !773, file: !773, line: 399, type: !774, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !813)
!773 = !DIFile(filename: "utils.cpp", directory: "/export/iusers/cczhao/Workspaces/DebugTests-XMAIN/JIRA-11388/531.exp.g/benchspec/CPU/531.deepsjeng_r/build/build_base_core_avx512.0000")
!774 = !DISubroutineType(types: !775)
!775 = !{null, !347, !391}
!776 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !773, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !777, globals: !778, nameTableKind: None)
!777 = !{!152, !113, !464}
!778 = !{!779, !781, !785, !770, !787, !807, !809, !811}
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "root_scores", scope: !776, file: !773, line: 31, type: !617, isLocal: false, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "multipv_strings", scope: !776, file: !773, line: 32, type: !783, isLocal: false, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 983040, elements: !784)
!784 = !{!611, !633}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "multipv_scores", scope: !776, file: !773, line: 33, type: !617, isLocal: false, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "levelstack", scope: !789, file: !773, line: 477, type: !804, isLocal: true, isDefinition: true)
!789 = distinct !DISubprogram(name: "hash_extract_pv", linkageName: "_ZL15hash_extract_pvP7state_tiPc", scope: !773, file: !773, line: 471, type: !790, scopeLine: 471, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !391, !113, !198}
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!793 = !DILocalVariable(name: "s", arg: 1, scope: !789, file: !773, line: 471, type: !391)
!794 = !DILocalVariable(name: "level", arg: 2, scope: !789, file: !773, line: 471, type: !113)
!795 = !DILocalVariable(name: "str", arg: 3, scope: !789, file: !773, line: 471, type: !198)
!796 = !DILocalVariable(name: "xdummy", scope: !789, file: !773, line: 472, type: !113)
!797 = !DILocalVariable(name: "bm", scope: !789, file: !773, line: 472, type: !113)
!798 = !DILocalVariable(name: "j", scope: !789, file: !773, line: 472, type: !113)
!799 = !DILocalVariable(name: "mv", scope: !789, file: !773, line: 473, type: !10)
!800 = !DILocalVariable(name: "moves", scope: !789, file: !773, line: 474, type: !609)
!801 = !DILocalVariable(name: "num_moves", scope: !789, file: !773, line: 475, type: !113)
