; REQUIRES: asserts
; RUN: opt < %s -qsortrecognizer -debug-only=qsortrecognizer -qsort-unit-test -qsort-test-compare-func -disable-output 2>&1 | FileCheck %s
; RUN: opt < %s -passes='module(qsortrecognizer)' -debug-only=qsortrecognizer -qsort-unit-test -qsort-test-compare-func -disable-output 2>&1 | FileCheck %s

; This test checks that the compare function was found when debug instructions
; are included. This is the same test as qsort-compare-func01.ll but with debug
; instructions and metadata.

; CHECK: QsortRec: Compare Function found: arc_compare
; CHECK: PASSED QSORT RECOGNITION UNIT TESTS

%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.basket = type { %struct.arc*, i64, i64, i64 }

declare void @llvm.dbg.value(metadata %0, metadata %1, metadata %2)
declare void @llvm.dbg.label(metadata %0)

define internal i32 @arc_compare(%struct.arc** nocapture readonly %arg, %struct.arc** nocapture readonly %arg1) {
bb:
  %tmp = load %struct.arc*, %struct.arc** %arg, align 8
  %tmp2 = getelementptr inbounds %struct.arc, %struct.arc* %tmp, i64 0, i32 7
  %tmp3 = load i64, i64* %tmp2, align 8
  %tmp4 = load %struct.arc*, %struct.arc** %arg1, align 8
  %tmp5 = getelementptr inbounds %struct.arc, %struct.arc* %tmp4, i64 0, i32 7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "basket_sizes", scope: !2, file: !3, line: 31, type: !57, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !58, nameTableKind: None)
!3 = !DIFile(filename: "psimplex.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!4 = !{}
!5 = !{!6, !11, !12, !57, !13}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !7, line: 97, baseType: !8)
!7 = !DIFile(filename: "./defines.h", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !9, line: 197, baseType: !10)
!9 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!10 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !7, line: 146, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !7, line: 140, size: 256, elements: !16)
!16 = !{!17, !54, !55, !56}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !15, file: !7, line: 142, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !21)
!21 = !{!22, !24, !26, !47, !48, !50, !51, !52, !53}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !20, file: !7, line: 170, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !20, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !7, line: 98, baseType: !8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !20, file: !7, line: 172, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !40, !41, !42, !43, !44, !45, !46}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !29, file: !7, line: 151, baseType: !25, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !29, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !29, file: !7, line: 153, baseType: !27, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !29, file: !7, line: 154, baseType: !27, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !29, file: !7, line: 155, baseType: !27, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !29, file: !7, line: 156, baseType: !27, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !29, file: !7, line: 157, baseType: !38, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !29, file: !7, line: 158, baseType: !38, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !29, file: !7, line: 158, baseType: !38, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !29, file: !7, line: 159, baseType: !38, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !29, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !29, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !29, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !29, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !20, file: !7, line: 172, baseType: !27, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !20, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!49 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !20, file: !7, line: 174, baseType: !38, size: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !20, file: !7, line: 174, baseType: !38, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !20, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !20, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !15, file: !7, line: 143, baseType: !25, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !15, file: !7, line: 144, baseType: !25, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !15, file: !7, line: 145, baseType: !8, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!58 = !{!59, !61, !0, !63, !65}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "opt_basket", scope: !2, file: !3, line: 29, type: !12, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "perm_p", scope: !2, file: !3, line: 30, type: !11, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "basket", scope: !2, file: !3, line: 33, type: !13, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "opt", scope: !2, file: !3, line: 32, type: !8, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "net", scope: !70, file: !71, line: 30, type: !81, isLocal: false, isDefinition: true)
!70 = distinct !DICompileUnit(language: DW_LANG_C99, file: !71, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !72, globals: !80, nameTableKind: None)
!71 = !DIFile(filename: "mcf.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!72 = !{!25, !73, !74, !8, !23, !77}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 51, baseType: !76)
!75 = !DIFile(filename: "deploy/linux_debug/lib/clang/10.0.0/include/stddef.h", directory: "/export/iusers/ayrivera/dev-505-debug")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!80 = !{!68}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !7, line: 206, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !7, line: 181, size: 5184, elements: !83)
!83 = !{!84, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !108, !109, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !82, file: !7, line: 183, baseType: !85, size: 1600)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 1600, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 200)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !82, file: !7, line: 184, baseType: !85, size: 1600, offset: 1600)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !82, file: !7, line: 185, baseType: !8, size: 64, offset: 3200)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !82, file: !7, line: 185, baseType: !8, size: 64, offset: 3264)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !82, file: !7, line: 186, baseType: !8, size: 64, offset: 3328)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !82, file: !7, line: 186, baseType: !8, size: 64, offset: 3392)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !82, file: !7, line: 186, baseType: !8, size: 64, offset: 3456)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !82, file: !7, line: 186, baseType: !8, size: 64, offset: 3520)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !82, file: !7, line: 187, baseType: !8, size: 64, offset: 3584)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !82, file: !7, line: 187, baseType: !8, size: 64, offset: 3648)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !82, file: !7, line: 189, baseType: !8, size: 64, offset: 3712)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !82, file: !7, line: 190, baseType: !8, size: 64, offset: 3776)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !82, file: !7, line: 191, baseType: !8, size: 64, offset: 3840)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !82, file: !7, line: 192, baseType: !8, size: 64, offset: 3904)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !82, file: !7, line: 193, baseType: !8, size: 64, offset: 3968)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !82, file: !7, line: 194, baseType: !8, size: 64, offset: 4032)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !82, file: !7, line: 195, baseType: !8, size: 64, offset: 4096)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !82, file: !7, line: 196, baseType: !8, size: 64, offset: 4160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !82, file: !7, line: 197, baseType: !8, size: 64, offset: 4224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !82, file: !7, line: 198, baseType: !107, size: 64, offset: 4288)
!107 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !82, file: !7, line: 199, baseType: !25, size: 64, offset: 4352)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !82, file: !7, line: 200, baseType: !110, size: 64, offset: 4416)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !134, !135, !136, !137, !138, !139, !140}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !112, file: !7, line: 151, baseType: !25, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !112, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !112, file: !7, line: 153, baseType: !110, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !112, file: !7, line: 154, baseType: !110, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !112, file: !7, line: 155, baseType: !110, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !112, file: !7, line: 156, baseType: !110, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !112, file: !7, line: 157, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !7, line: 170, baseType: !23, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !123, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !123, file: !7, line: 172, baseType: !110, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !123, file: !7, line: 172, baseType: !110, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !123, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !123, file: !7, line: 174, baseType: !121, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !123, file: !7, line: 174, baseType: !121, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !123, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !123, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !112, file: !7, line: 158, baseType: !121, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !112, file: !7, line: 158, baseType: !121, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !112, file: !7, line: 159, baseType: !121, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !112, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !112, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !112, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !112, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !82, file: !7, line: 200, baseType: !110, size: 64, offset: 4480)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !82, file: !7, line: 201, baseType: !121, size: 64, offset: 4544)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !82, file: !7, line: 201, baseType: !121, size: 64, offset: 4608)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !82, file: !7, line: 201, baseType: !121, size: 64, offset: 4672)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !82, file: !7, line: 202, baseType: !121, size: 64, offset: 4736)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !82, file: !7, line: 202, baseType: !121, size: 64, offset: 4800)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !82, file: !7, line: 203, baseType: !8, size: 64, offset: 4864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !82, file: !7, line: 204, baseType: !8, size: 64, offset: 4928)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !82, file: !7, line: 205, baseType: !8, size: 64, offset: 4992)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !82, file: !7, line: 205, baseType: !8, size: 64, offset: 5056)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !82, file: !7, line: 205, baseType: !8, size: 64, offset: 5120)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "full_group_end_arc", scope: !154, file: !155, line: 30, type: !163, isLocal: true, isDefinition: true)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !156, globals: !162, nameTableKind: None)
!155 = !DIFile(filename: "pbeampp.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!23, !160, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!162 = !{!152}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !166)
!166 = !{!167, !168, !169, !190, !191, !192, !193, !194, !195}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !7, line: 170, baseType: !23, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !165, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !165, file: !7, line: 172, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !183, !184, !185, !186, !187, !188, !189}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !172, file: !7, line: 151, baseType: !25, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !172, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !172, file: !7, line: 153, baseType: !170, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !172, file: !7, line: 154, baseType: !170, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !172, file: !7, line: 155, baseType: !170, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !172, file: !7, line: 156, baseType: !170, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !172, file: !7, line: 157, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !172, file: !7, line: 158, baseType: !181, size: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !172, file: !7, line: 158, baseType: !181, size: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !172, file: !7, line: 159, baseType: !181, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !172, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !172, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !172, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !172, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !165, file: !7, line: 172, baseType: !170, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !165, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !165, file: !7, line: 174, baseType: !181, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !165, file: !7, line: 174, baseType: !181, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !165, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !165, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !198, globals: !234, nameTableKind: None)
!197 = !DIFile(filename: "mcfutil.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!198 = !{!73, !199, !232, !6, !107, !25}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !7, line: 134, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !202)
!202 = !{!203, !204, !205, !208, !209, !210, !211, !225, !226, !227, !228, !229, !230, !231}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !201, file: !7, line: 151, baseType: !25, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !201, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !201, file: !7, line: 153, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !201, file: !7, line: 154, baseType: !206, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !201, file: !7, line: 155, baseType: !206, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !201, file: !7, line: 156, baseType: !206, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !201, file: !7, line: 157, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !7, line: 170, baseType: !23, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !214, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !214, file: !7, line: 172, baseType: !206, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !214, file: !7, line: 172, baseType: !206, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !214, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !214, file: !7, line: 174, baseType: !212, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !214, file: !7, line: 174, baseType: !212, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !214, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !214, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !201, file: !7, line: 158, baseType: !212, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !201, file: !7, line: 158, baseType: !212, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !201, file: !7, line: 159, baseType: !212, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !201, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !201, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !201, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !201, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !214)
!234 = !{!235, !237}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "old_group", scope: !196, file: !197, line: 121, type: !8, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "old_Arc", scope: !196, file: !197, line: 122, type: !8, isLocal: true, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !241, nameTableKind: None)
!240 = !DIFile(filename: "readmin.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!241 = !{!73, !8, !107, !242, !275, !6, !25, !79}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !7, line: 134, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !245)
!245 = !{!246, !247, !248, !251, !252, !253, !254, !268, !269, !270, !271, !272, !273, !274}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !244, file: !7, line: 151, baseType: !25, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !244, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !244, file: !7, line: 153, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !244, file: !7, line: 154, baseType: !249, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !244, file: !7, line: 155, baseType: !249, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !244, file: !7, line: 156, baseType: !249, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !244, file: !7, line: 157, baseType: !255, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !257, file: !7, line: 170, baseType: !23, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !257, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !257, file: !7, line: 172, baseType: !249, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !257, file: !7, line: 172, baseType: !249, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !257, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !257, file: !7, line: 174, baseType: !255, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !257, file: !7, line: 174, baseType: !255, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !257, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !257, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !244, file: !7, line: 158, baseType: !255, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !244, file: !7, line: 158, baseType: !255, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !244, file: !7, line: 159, baseType: !255, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !244, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !244, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !244, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !244, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !257)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !279, nameTableKind: None)
!278 = !DIFile(filename: "implicit.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!279 = !{!280, !57, !313, !6, !25, !281, !315, !73, !8, !157}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !285)
!285 = !{!286, !287, !288, !307, !308, !309, !310, !311, !312}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !284, file: !7, line: 170, baseType: !23, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !284, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !284, file: !7, line: 172, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !291, file: !7, line: 151, baseType: !25, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !291, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !291, file: !7, line: 153, baseType: !289, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !291, file: !7, line: 154, baseType: !289, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !291, file: !7, line: 155, baseType: !289, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !291, file: !7, line: 156, baseType: !289, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !291, file: !7, line: 157, baseType: !282, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !291, file: !7, line: 158, baseType: !282, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !291, file: !7, line: 158, baseType: !282, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !291, file: !7, line: 159, baseType: !282, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !291, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !291, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !291, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !291, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !7, line: 172, baseType: !289, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !284, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !284, file: !7, line: 174, baseType: !282, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !284, file: !7, line: 174, baseType: !282, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !284, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !284, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !284)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_elem", file: !7, line: 212, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_elem", file: !7, line: 208, size: 128, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arc", scope: !317, file: !7, line: 210, baseType: !313, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !7, line: 211, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !324, nameTableKind: None)
!323 = !DIFile(filename: "pstart.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!324 = !{!25, !8, !6}
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !327, nameTableKind: None)
!326 = !DIFile(filename: "output.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!327 = !{!73}
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!329 = !DIFile(filename: "treeup.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !332, nameTableKind: None)
!331 = !DIFile(filename: "pbla.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!332 = !{!6}
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !332, nameTableKind: None)
!334 = !DIFile(filename: "pflowup.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang based Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !337, nameTableKind: None)
!336 = !DIFile(filename: "spec_qsort/spec_qsort/spec_qsort.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!337 = !{!78, !338, !339, !8}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!340 = !{!"Intel(R) oneAPI DPC++ Compiler 2021.1 (YYYY.x.0.MMDD)"}
!341 = !{i32 7, !"Dwarf Version", i32 4}
!342 = !{i32 2, !"Debug Info Version", i32 3}
!343 = !{i32 1, !"wchar_size", i32 4}
!344 = !{i32 1, !"ThinLTO", i32 0}
!345 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!346 = !{i32 1, !"LTOPostLink", i32 1}
!347 = distinct !DISubprogram(name: "global_opt", scope: !71, file: !71, line: 37, type: !348, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!8}
!350 = !{!351, !352}
!351 = !DILocalVariable(name: "new_arcs", scope: !347, file: !71, line: 42, type: !8)
!352 = !DILocalVariable(name: "residual_nb_it", scope: !347, file: !71, line: 43, type: !8)
!353 = !DILocation(line: 0, scope: !347)
!354 = !DILocation(line: 48, column: 3, scope: !347)
!355 = !DILocation(line: 51, column: 63, scope: !356)
!356 = distinct !DILexicalBlock(scope: !347, file: !71, line: 49, column: 3)
!357 = !{!358, !362, i64 424}
!358 = !{!"struct@network", !359, i64 0, !359, i64 200, !362, i64 400, !362, i64 408, !362, i64 416, !362, i64 424, !362, i64 432, !362, i64 440, !362, i64 448, !362, i64 456, !362, i64 464, !362, i64 472, !362, i64 480, !362, i64 488, !362, i64 496, !362, i64 504, !362, i64 512, !362, i64 520, !362, i64 528, !363, i64 536, !362, i64 544, !364, i64 552, !364, i64 560, !365, i64 568, !365, i64 576, !365, i64 584, !365, i64 592, !365, i64 600, !362, i64 608, !362, i64 616, !362, i64 624, !362, i64 632, !362, i64 640}
!359 = !{!"array@_ZTSA200_c", !360, i64 0}
!360 = !{!"omnipotent char", !361, i64 0}
!361 = !{!"Simple C/C++ TBAA"}
!362 = !{!"long", !360, i64 0}
!363 = !{!"double", !360, i64 0}
!364 = !{!"pointer@_ZTSP4node", !360, i64 0}
!365 = !{!"pointer@_ZTSP3arc", !360, i64 0}
!366 = !DILocation(line: 51, column: 5, scope: !356)
!367 = !DILocation(line: 54, column: 5, scope: !356)
!368 = !DILocation(line: 57, column: 63, scope: !356)
!369 = !{!358, !362, i64 608}
!370 = !DILocation(line: 57, column: 5, scope: !356)
!371 = !DILocation(line: 58, column: 53, scope: !356)
!372 = !DILocation(line: 58, column: 5, scope: !356)
!373 = !DILocation(line: 67, column: 13, scope: !374)
!374 = distinct !DILexicalBlock(scope: !356, file: !71, line: 67, column: 9)
!375 = !{!358, !362, i64 440}
!376 = !DILocation(line: 67, column: 9, scope: !374)
!377 = !DILocation(line: 67, column: 9, scope: !356)
!378 = !DILocation(line: 69, column: 18, scope: !379)
!379 = distinct !DILexicalBlock(scope: !374, file: !71, line: 68, column: 5)
!380 = !DILocation(line: 71, column: 21, scope: !381)
!381 = distinct !DILexicalBlock(scope: !379, file: !71, line: 71, column: 12)
!382 = !DILocation(line: 71, column: 12, scope: !379)
!383 = !DILocation(line: 74, column: 9, scope: !384)
!384 = distinct !DILexicalBlock(scope: !381, file: !71, line: 72, column: 7)
!385 = !DILocation(line: 77, column: 9, scope: !384)
!386 = !DILocation(line: 80, column: 11, scope: !387)
!387 = distinct !DILexicalBlock(scope: !379, file: !71, line: 80, column: 11)
!388 = !DILocation(line: 80, column: 11, scope: !379)
!389 = !DILocation(line: 81, column: 9, scope: !387)
!390 = !DILocation(line: 86, column: 58, scope: !391)
!391 = distinct !DILexicalBlock(scope: !374, file: !71, line: 85, column: 5)
!392 = !DILocation(line: 86, column: 7, scope: !391)
!393 = !DILocation(line: 90, column: 16, scope: !356)
!394 = !DILocation(line: 93, column: 9, scope: !356)
!395 = !DILocation(line: 94, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !356, file: !71, line: 93, column: 9)
!397 = !DILocation(line: 97, column: 18, scope: !398)
!398 = distinct !DILexicalBlock(scope: !356, file: !71, line: 97, column: 9)
!399 = !DILocation(line: 97, column: 9, scope: !356)
!400 = !DILocation(line: 100, column: 7, scope: !401)
!401 = distinct !DILexicalBlock(scope: !398, file: !71, line: 98, column: 5)
!402 = !DILocation(line: 103, column: 7, scope: !401)
!403 = !DILocation(line: 113, column: 17, scope: !347)
!404 = !DILocation(line: 113, column: 15, scope: !347)
!405 = !{!358, !363, i64 536}
!406 = !DILocation(line: 114, column: 3, scope: !347)
!407 = distinct !DISubprogram(name: "main", scope: !71, file: !71, line: 125, type: !408, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!23, !23, !77}
!410 = !{!411, !412, !413, !414}
!411 = !DILocalVariable(name: "argc", arg: 1, scope: !407, file: !71, line: 125, type: !23)
!412 = !DILocalVariable(name: "argv", arg: 2, scope: !407, file: !71, line: 125, type: !77)
!413 = !DILocalVariable(name: "outnum", scope: !407, file: !71, line: 132, type: !23)
!414 = !DILocalVariable(name: "outfile", scope: !407, file: !71, line: 133, type: !415)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 640, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 80)
!418 = !DILocation(line: 0, scope: !407)
!419 = !DILocation(line: 133, column: 3, scope: !407)
!420 = !DILocation(line: 133, column: 8, scope: !407)
!421 = !DILocation(line: 134, column: 12, scope: !422)
!422 = distinct !DILexicalBlock(scope: !407, file: !71, line: 134, column: 7)
!423 = !DILocation(line: 134, column: 7, scope: !407)
!424 = !DILocation(line: 142, column: 3, scope: !407)
!425 = !DILocation(line: 143, column: 3, scope: !407)
!426 = !DILocation(line: 144, column: 3, scope: !407)
!427 = !DILocation(line: 145, column: 3, scope: !407)
!428 = !DILocation(line: 146, column: 3, scope: !407)
!429 = !DILocation(line: 148, column: 3, scope: !407)
!430 = !DILocation(line: 152, column: 3, scope: !407)
!431 = !DILocation(line: 153, column: 12, scope: !407)
!432 = !{!358, !362, i64 528}
!433 = !DILocation(line: 156, column: 26, scope: !407)
!434 = !{!435, !435, i64 0}
!435 = !{!"pointer@_ZTSPc", !360, i64 0}
!436 = !DILocation(line: 156, column: 3, scope: !407)
!437 = !DILocation(line: 157, column: 12, scope: !438)
!438 = distinct !DILexicalBlock(scope: !407, file: !71, line: 157, column: 7)
!439 = !DILocation(line: 157, column: 7, scope: !407)
!440 = !DILocation(line: 158, column: 20, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !71, line: 157, column: 18)
!442 = !DILocalVariable(name: "__nptr", arg: 1, scope: !443, file: !444, line: 278, type: !447)
!443 = distinct !DISubprogram(name: "atoi", scope: !444, file: !444, line: 278, type: !445, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !449)
!444 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!445 = !DISubroutineType(types: !446)
!446 = !{!23, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!449 = !{!442}
!450 = !DILocation(line: 0, scope: !443, inlinedAt: !451)
!451 = distinct !DILocation(line: 158, column: 15, scope: !441)
!452 = !DILocation(line: 280, column: 16, scope: !443, inlinedAt: !451)
!453 = !DILocation(line: 280, column: 10, scope: !443, inlinedAt: !451)
!454 = !DILocation(line: 159, column: 6, scope: !441)
!455 = !DILocation(line: 160, column: 3, scope: !441)
!456 = !DILocation(line: 161, column: 6, scope: !457)
!457 = distinct !DILexicalBlock(scope: !438, file: !71, line: 160, column: 10)
!458 = !DILocation(line: 164, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !407, file: !71, line: 164, column: 7)
!460 = !DILocation(line: 164, column: 7, scope: !407)
!461 = !DILocation(line: 166, column: 5, scope: !462)
!462 = distinct !DILexicalBlock(scope: !459, file: !71, line: 165, column: 3)
!463 = !DILocation(line: 167, column: 5, scope: !462)
!464 = !DILocation(line: 168, column: 5, scope: !462)
!465 = !DILocation(line: 180, column: 61, scope: !407)
!466 = !{!358, !362, i64 408}
!467 = !DILocation(line: 180, column: 3, scope: !407)
!468 = !DILocation(line: 184, column: 3, scope: !407)
!469 = !DILocation(line: 185, column: 3, scope: !407)
!470 = !DILocation(line: 189, column: 7, scope: !471)
!471 = distinct !DILexicalBlock(scope: !407, file: !71, line: 189, column: 7)
!472 = !DILocation(line: 189, column: 7, scope: !407)
!473 = !DILocation(line: 204, column: 3, scope: !407)
!474 = !DILocation(line: 208, column: 3, scope: !407)
!475 = !DILocation(line: 209, column: 1, scope: !407)
!476 = distinct !DISubprogram(name: "markBaskets", scope: !3, file: !3, line: 36, type: !477, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !8}
!479 = !{!480, !481, !482, !483, !484, !526}
!480 = !DILocalVariable(name: "num_threads", arg: 1, scope: !476, file: !3, line: 36, type: !8)
!481 = !DILocalVariable(name: "i", scope: !476, file: !3, line: 42, type: !8)
!482 = !DILocalVariable(name: "j", scope: !476, file: !3, line: 42, type: !8)
!483 = !DILocalVariable(name: "max_pos", scope: !476, file: !3, line: 42, type: !8)
!484 = !DILocalVariable(name: "max", scope: !476, file: !3, line: 43, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !7, line: 146, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !7, line: 140, size: 256, elements: !488)
!488 = !{!489, !523, !524, !525}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !487, file: !7, line: 142, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !493)
!493 = !{!494, !495, !496, !517, !518, !519, !520, !521, !522}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !492, file: !7, line: 170, baseType: !23, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !492, file: !7, line: 171, baseType: !25, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !492, file: !7, line: 172, baseType: !497, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !510, !511, !512, !513, !514, !515, !516}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !499, file: !7, line: 151, baseType: !25, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !499, file: !7, line: 152, baseType: !23, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !499, file: !7, line: 153, baseType: !497, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !499, file: !7, line: 154, baseType: !497, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !499, file: !7, line: 155, baseType: !497, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !499, file: !7, line: 156, baseType: !497, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !499, file: !7, line: 157, baseType: !508, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !499, file: !7, line: 158, baseType: !508, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !499, file: !7, line: 158, baseType: !508, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !499, file: !7, line: 159, baseType: !508, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !499, file: !7, line: 160, baseType: !6, size: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !499, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !499, file: !7, line: 162, baseType: !23, size: 32, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !499, file: !7, line: 163, baseType: !23, size: 32, offset: 800)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !492, file: !7, line: 172, baseType: !497, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !492, file: !7, line: 173, baseType: !49, size: 16, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !492, file: !7, line: 174, baseType: !508, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !492, file: !7, line: 174, baseType: !508, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !492, file: !7, line: 175, baseType: !6, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !492, file: !7, line: 176, baseType: !25, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !487, file: !7, line: 143, baseType: !25, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !487, file: !7, line: 144, baseType: !25, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !487, file: !7, line: 145, baseType: !8, size: 64, offset: 192)
!526 = !DILocalVariable(name: "act", scope: !476, file: !3, line: 43, type: !13)
!527 = !DILocation(line: 0, scope: !476)
!528 = !DILocation(line: 46, column: 13, scope: !529)
!529 = distinct !DILexicalBlock(scope: !530, file: !3, line: 46, column: 11)
!530 = distinct !DILexicalBlock(scope: !531, file: !3, line: 45, column: 27)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 45, column: 5)
!532 = distinct !DILexicalBlock(scope: !476, file: !3, line: 45, column: 5)
!533 = !{!534, !534, i64 0}
!534 = !{!"pointer@_ZTSPPP6basket", !360, i64 0}
!535 = !DILocation(line: 45, column: 5, scope: !532)
!536 = !{!537, !537, i64 0}
!537 = !{!"pointer@_ZTSPP6basket", !360, i64 0}
!538 = !DILocation(line: 46, column: 12, scope: !529)
!539 = !{!540, !540, i64 0}
!540 = !{!"pointer@_ZTSP6basket", !360, i64 0}
!541 = !DILocation(line: 46, column: 25, scope: !529)
!542 = !{!543, !362, i64 24}
!543 = !{!"struct@basket", !365, i64 0, !362, i64 8, !362, i64 16, !362, i64 24}
!544 = !DILocation(line: 46, column: 32, scope: !529)
!545 = !DILocation(line: 63, column: 12, scope: !546)
!546 = distinct !DILexicalBlock(scope: !530, file: !3, line: 63, column: 11)
!547 = !DILocation(line: 63, column: 11, scope: !530)
!548 = !DILocation(line: 67, column: 14, scope: !530)
!549 = !DILocation(line: 67, column: 21, scope: !530)
!550 = !DILocation(line: 68, column: 26, scope: !530)
!551 = !DILocation(line: 45, column: 23, scope: !531)
!552 = !DILocation(line: 45, column: 17, scope: !531)
!553 = distinct !{!553, !535, !554}
!554 = !DILocation(line: 69, column: 5, scope: !532)
!555 = !DILocation(line: 70, column: 1, scope: !476)
!556 = distinct !DISubprogram(name: "spec_qsort", scope: !557, file: !557, line: 115, type: !558, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !562)
!557 = !DIFile(filename: "spec_qsort/spec_qsort.c", directory: "/export/iusers/ayrivera/dev-505-debug/test/benchspec/CPU/505.mcf_r/build/build_base_core_avx512.0000")
!558 = !DISubroutineType(types: !559)
!559 = !{null, !73, !74, !74, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmp_t", file: !557, line: 56, baseType: !158)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !589, !599, !602, !606, !615, !625, !631, !638, !641, !645, !654, !664}
!563 = !DILocalVariable(name: "a", arg: 1, scope: !556, file: !557, line: 115, type: !73)
!564 = !DILocalVariable(name: "n", arg: 2, scope: !556, file: !557, line: 115, type: !74)
!565 = !DILocalVariable(name: "es", arg: 3, scope: !556, file: !557, line: 115, type: !74)
!566 = !DILocalVariable(name: "cmp", arg: 4, scope: !556, file: !557, line: 115, type: !560)
!567 = !DILocalVariable(name: "pa", scope: !556, file: !557, line: 117, type: !78)
!568 = !DILocalVariable(name: "pb", scope: !556, file: !557, line: 117, type: !78)
!569 = !DILocalVariable(name: "pc", scope: !556, file: !557, line: 117, type: !78)
!570 = !DILocalVariable(name: "pd", scope: !556, file: !557, line: 117, type: !78)
!571 = !DILocalVariable(name: "pl", scope: !556, file: !557, line: 117, type: !78)
!572 = !DILocalVariable(name: "pm", scope: !556, file: !557, line: 117, type: !78)
!573 = !DILocalVariable(name: "pn", scope: !556, file: !557, line: 117, type: !78)
!574 = !DILocalVariable(name: "d", scope: !556, file: !557, line: 118, type: !74)
!575 = !DILocalVariable(name: "r", scope: !556, file: !557, line: 118, type: !74)
!576 = !DILocalVariable(name: "cmp_result", scope: !556, file: !557, line: 119, type: !23)
!577 = !DILocalVariable(name: "swaptype_long", scope: !556, file: !557, line: 120, type: !23)
!578 = !DILocalVariable(name: "swaptype_int", scope: !556, file: !557, line: 120, type: !23)
